In [2]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [1]:
#Axis-> 0 for dataframes columns and 1 for rows

# Introduction to pandas and Data Structures

To get started with pandas,you will need to get comfortable with Series and Data Frame.

# Series

In [2]:
obj=Series([1,2,3,4,5])
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
obj2=Series([4,7,-5,3],index=['d','b','a','c'])

In [6]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2[['a','b','c']]

a   -5
b    7
c    3
dtype: int64

In [10]:
type(obj2)

pandas.core.series.Series

In [12]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [13]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
#we can create a seris from a dictionary

In [19]:
sdata={'ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3=Series(sdata)
obj3

Oregon    16000
Texas     71000
Utah       5000
ohio      35000
dtype: int64

In [20]:
sdata

{'Oregon': 16000, 'Texas': 71000, 'Utah': 5000, 'ohio': 35000}

In [21]:
states=['california','ohio']
obj4=Series(sdata,index=states)

In [22]:
obj4 #Nan->not a number-> missing or NA values

california        NaN
ohio          35000.0
dtype: float64

In [23]:
obj3+obj4 #in case o arithmetic operations it automatically alligns the index values

Oregon            NaN
Texas             NaN
Utah              NaN
california        NaN
ohio          70000.0
dtype: float64

In [24]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
obj.name='population'#assigning name to object and index is possible but not values
obj.index.name='abhi'
obj

abhi
0    1
1    2
2    3
3    4
4    5
Name: population, dtype: int64

In [28]:
obj.index=['a','b','c','d','e']
obj

a    1
b    2
c    3
d    4
e    5
Name: population, dtype: int64

# DataFrame

In [30]:
#construct a data frame from a dict of equal-length lists or numpy arrays

In [5]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002],'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=DataFrame(data)
frame#COLOUMNS ARE PLACED IN SORTED ORDER

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [6]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [7]:
frame2=DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [8]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [9]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [10]:
frame2['year']#to retrieve a particular coloumn

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [11]:
frame2['debt']=np.arange(5)#to modify a coloumn
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

When assigning lists or arrays to a column,the values length must match the length of the data frame.

In [12]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [13]:
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [14]:
#delete coloumns

In [15]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

# nested dict of dict format

In [17]:
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [18]:
frame3=DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [20]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [21]:
#The keys in the inner dicts are unioned and sorted to form the index in the result

In [22]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

# Dicts of Series format

In [23]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [24]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [25]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [26]:
frame3.index.name='year'
frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [ ]:
#Displaying values

In [27]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [28]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [29]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

# Index Objects

In [30]:
#pandas index objects are responsible for holding the axis labels and they are immutable

In [31]:
obj=Series(range(3),index=['a','b','c'])
index=obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [32]:
index[1:]

Index(['b', 'c'], dtype='object')

In [33]:
index[1]='d'

TypeError: Index does not support mutable operations

# Essential Functionality

# Reindexing

In [1]:
#to create a new object with the data conformed to a new index

In [3]:
obj=Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [6]:
#for ordered data like time series,it may be desirable to do some interpolation or filling of values when reindexing.
#ffill can be used to do this

In [7]:
obj3=Series(['blue','yellow','purple'],index=[0,2,4])
obj3

0      blue
2    yellow
4    purple
dtype: object

In [8]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [9]:
#for dataframe reindex can alter either the (row) index,columns or both.

In [10]:
frame=DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['ohio','texas','california'])
frame

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [11]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [12]:
states=['texas','utah','california']
frame.reindex(columns=states)

   texas  utah  california
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [13]:
#both can be reindexed in one shot,but ineterpolation will be applied to row wise only

In [14]:
frame.reindex(columns=states,index=['a','b','c','d'],method='ffill')

   texas  utah  california
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [1]:
#set one of columns as index

In [4]:
df = DataFrame(np.random.randn(3,3),columns=['a','b','c'])

In [6]:
df['index']=['zero','one','two']

In [7]:
df

          a         b         c index
0  0.613143  1.858593  0.413290  zero
1 -0.508144 -0.672005 -0.013390   one
2  1.099877  1.144332  1.910523   two

In [8]:
df.set_index('index')

              a         b         c
index
zero   0.613143  1.858593  0.413290
one   -0.508144 -0.672005 -0.013390
two    1.099877  1.144332  1.910523

# Dropping entries from an axis

In [16]:
obj=Series(np.arange(5),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [17]:
new_obj=obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [18]:
new_obj=obj.drop(['c','a'])
new_obj

b    1
d    3
e    4
dtype: int32

In [19]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['ohio','colorado','utah','newyork'],columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [20]:
data.drop(['colorado','utah'])

         one  two  three  four
ohio       0    1      2     3
newyork   12   13     14    15

In [21]:
data.drop(['two','four'],axis=1)

          one  three
ohio        0      2
colorado    4      6
utah        8     10
newyork    12     14

# Indexing,selection,and filtering

In [22]:
obj=Series(np.arange(4),index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [23]:
obj['b']

1

In [24]:
obj[1]

1

In [25]:
obj[2:4]

c    2
d    3
dtype: int32

In [26]:
obj[['a','b','c']]

a    0
b    1
c    2
dtype: int32

In [27]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [28]:
obj[obj<2]

a    0
b    1
dtype: int32

In [29]:
#Slicing with labels behaves differently than normal python slicing in that the endpoint is inclusive:

In [30]:
obj['b':'c']

b    1
c    2
dtype: int32

In [31]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [32]:
obj['b':'c']=5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [34]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['ohio','colorado','utah','newyork'],columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [35]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [36]:
data['one']

ohio         0
colorado     4
utah         8
newyork     12
Name: one, dtype: int32

In [47]:
data[:1]

      one  two  three  four
ohio    0    1      2     3

In [48]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [49]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
newyork   False  False  False  False

In [51]:
data[data<5]=0
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [52]:
#For data frame label indexing on rows ix is used

In [53]:
data.ix['colorado',['two','three']]

two      5
three    6
Name: colorado, dtype: int32

In [54]:
data.ix[['colorado','utah'],['two','three']]

          two  three
colorado    5      6
utah        9     10

In [58]:
data.ix[2]#selects rows

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

In [59]:
data.ix[:'utah','two']#first is for row and second is for coloumn

ohio        0
colorado    5
utah        9
Name: two, dtype: int32

In [61]:
data.ix[data.three>5,:2]

          one  two
colorado    0    5
utah        8    9
newyork    12   13

In [64]:
data.ix[:2,2]

ohio        0
colorado    6
Name: three, dtype: int32

# Arithmetic and data alignment

In [2]:
df1=DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['ohio','texas','colorado'])
df2=DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['utah','ohio','texas','oragon'])

In [3]:
df1

          b  c  d
ohio      0  1  2
texas     3  4  5
colorado  6  7  8

In [4]:
df2

        b   d   e
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oragon  9  10  11

In [5]:
df1 + df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oragon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

# Arithmetic methods with fill values

In [6]:
df1.add(df2,fill_value=0)

            b    c     d     e
colorado  6.0  7.0   8.0   NaN
ohio      3.0  1.0   6.0   5.0
oragon    9.0  NaN  10.0  11.0
texas     9.0  4.0  12.0   8.0
utah      0.0  NaN   1.0   2.0

In [7]:
df2.add(df1,fill_value=0)

            b    c     d     e
colorado  6.0  7.0   8.0   NaN
ohio      3.0  1.0   6.0   5.0
oragon    9.0  NaN  10.0  11.0
texas     9.0  4.0  12.0   8.0
utah      0.0  NaN   1.0   2.0

In [12]:
df1

          b  c  d
ohio      0  1  2
texas     3  4  5
colorado  6  7  8

In [13]:
df2

        b   d   e
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oragon  9  10  11

In [14]:
df1.reindex(columns=df2.columns,fill_value=0)

          b  d  e
ohio      0  2  0
texas     3  5  0
colorado  6  8  0

In [ ]:
#similarly sub,div,mul

# Function application and mapping

In [15]:
frame=DataFrame(np.random.randn(4,3),columns=list('bde'),index=['utah','ohio','Texas','oregon'])
frame

               b         d         e
utah   -2.387287  0.714055  0.192809
ohio   -1.184784  0.065156 -1.104852
Texas  -1.526034 -0.234074  0.278660
oregon -0.977796  1.840165  0.542039

In [16]:
np.abs(frame)

               b         d         e
utah    2.387287  0.714055  0.192809
ohio    1.184784  0.065156  1.104852
Texas   1.526034  0.234074  0.278660
oregon  0.977796  1.840165  0.542039

In [21]:
f= lambda x: max(x) - min(x)

In [22]:
z=[5,6,7,8]
f(z)

3

In [25]:
frame.apply(f)#apply function to each coloumns

b    1.409492
d    2.074238
e    1.646891
dtype: float64

In [26]:
frame.apply(f,axis=1)

utah      3.101343
ohio      1.249941
Texas     1.804694
oregon    2.817961
dtype: float64

In [ ]:
#Most of the common array statistics(like sum and mean) are DataFrame methods,so using apply is not necessary

In [27]:
#the function passed to apply need not return a scalar value,it can also return a series with multiple values

In [28]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

            b         d         e
min -2.387287 -0.234074 -1.104852
max -0.977796  1.840165  0.542039

In [29]:
frame.apply(f,axis=1)

             min       max
utah   -2.387287  0.714055
ohio   -1.184784  0.065156
Texas  -1.526034  0.278660
oregon -0.977796  1.840165

In [30]:
format = lambda x: '%.2f' %x
frame.applymap(format)#to pass functions element wise

            b      d      e
utah    -2.39   0.71   0.19
ohio    -1.18   0.07  -1.10
Texas   -1.53  -0.23   0.28
oregon  -0.98   1.84   0.54

In [31]:
frame['e']

utah      0.192809
ohio     -1.104852
Texas     0.278660
oregon    0.542039
Name: e, dtype: float64

In [32]:
frame['e'].map(format)

utah       0.19
ohio      -1.10
Texas      0.28
oregon     0.54
Name: e, dtype: object

# Sorting and Ranking

In [33]:
obj=Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [34]:
frame=DataFrame(np.arange(8).reshape((2,4)),columns=list('dabc'),index=['three','one'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [35]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [36]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [37]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [40]:
#to sort a series by its values use its order method:
obj=Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [41]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [43]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [44]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [45]:
#Ranking

In [46]:
obj=Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [49]:
obj.rank(ascending=False,method='first')#method='average'(default),'min','max','first'

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [50]:
#Axis indexes with duplicate values

In [51]:
obj=Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [52]:
obj.index.is_unique#to check if index values are unique or not

False

In [53]:
obj['a']

a    0
a    1
dtype: int32

In [57]:
df=DataFrame(np.random.randn(4,3),index=['a','a','b','b'],columns=[1,1,2])
df

          1         1         2
a -1.280155  0.348843 -0.715873
a  1.095522  1.066191 -1.998601
b  0.864765  0.737295  0.054987
b  0.422967 -1.049559  1.076584

In [60]:
df.ix[:,1]

          1         1
a -1.280155  0.348843
a  1.095522  1.066191
b  0.864765  0.737295
b  0.422967 -1.049559

In [62]:
df.ix['a']

          1         1         2
a -1.280155  0.348843 -0.715873
a  1.095522  1.066191 -1.998601

# Summarizing and Computing Descriptive Statistice

In [4]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=list('abcd'),columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()#statistics like mean and sum takes care of NA values

one    9.25
two   -5.80
dtype: float64

In [8]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [9]:
#NA values are excluded unless the entire slice(row or column in this case) is NA.This can be disabled 
#using the skipna option

In [10]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [11]:
#idxmin and idxmax returns statistics like tje index value where the minimum or maximum values are attained:

In [13]:
df.idxmin()

one    d
two    b
dtype: object

In [14]:
df.idxmax()

one    b
two    d
dtype: object

In [15]:
#accumualtions

In [16]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [17]:
#Summary of statistics

In [18]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [20]:
df['one'].argmin()

'd'

In [21]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [22]:
df.quantile()

one    1.4
two   -2.9
Name: 0.5, dtype: float64

In [23]:
#mean,median,mad(mean absolute deviation from mean value),var,std,skew,kurt

In [26]:
df.diff()#first difference

   one  two
a  NaN  NaN
b  5.7  NaN
c  NaN  NaN
d  NaN  NaN

In [27]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [28]:
df.cummax()

   one  two
a  1.4  NaN
b  7.1 -4.5
c  NaN  NaN
d  7.1 -1.3

In [29]:
df.cummin()

    one  two
a  1.40  NaN
b  1.40 -4.5
c   NaN  NaN
d  0.75 -4.5

# correlation and covariance

In [30]:
#taking data from yahoo finance

In [12]:
returns=DataFrame(np.random.randn(4,4),columns=['AAPL','GOOG','IBM','MSFT'],index=['2009-12-24','2009-12-28','2009-12-29','2009-12-30'])

In [13]:
returns

                AAPL      GOOG       IBM      MSFT
2009-12-24 -0.370001 -0.287188 -2.327714 -0.719261
2009-12-28 -0.981497  1.707419  1.020983  1.376971
2009-12-29  0.029960 -1.000129  0.398059 -0.358152
2009-12-30 -1.060109 -0.102764 -0.574329 -0.571350

In [14]:
returns.MSFT.corr(returns.IBM)

0.74114968755281407

In [15]:
returns.MSFT.cov(returns.IBM)

1.0549692720457613

In [16]:
#correlation or covariance matrix

In [17]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000 -0.726029 -0.177374 -0.430126
GOOG -0.726029  1.000000  0.433826  0.889274
IBM  -0.177374  0.433826  1.000000  0.741150
MSFT -0.430126  0.889274  0.741150  1.000000

In [24]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.268968 -0.433881 -0.134351 -0.217410
GOOG -0.433881  1.327800  0.730100  0.998702
IBM  -0.134351  0.730100  2.133046  1.054969
MSFT -0.217410  0.998702  1.054969  0.949877

In [19]:
#pairwise corelation

In [22]:
returns.corrwith(returns.IBM)

AAPL   -0.177374
GOOG    0.433826
IBM     1.000000
MSFT    0.741150
dtype: float64

In [25]:
volumes=DataFrame(np.random.randn(4,4),columns=['AAPL','GOOG','IBM','MSFT'],index=['2009-12-24','2009-12-28','2009-12-29','2009-12-30'])

In [26]:
volumes

                AAPL      GOOG       IBM      MSFT
2009-12-24  0.707372 -0.287111  0.256377  0.553827
2009-12-28 -0.775824 -0.651544  0.759489  0.405264
2009-12-29  1.840096 -0.669533  1.455251  0.850021
2009-12-30 -0.543015  0.491570  0.815122 -1.812649

In [27]:
returns.corrwith(volumes)

AAPL    0.987587
GOOG   -0.171650
IBM     0.700243
MSFT    0.249300
dtype: float64

In [28]:
returns.corrwith(volumes,axis=1)

2009-12-24   -0.027864
2009-12-28    0.429043
2009-12-29    0.913670
2009-12-30    0.350701
dtype: float64

# Unique values,value counts and membership

In [30]:
obj=Series(['c','a','d','a','a','b','b','c','c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [31]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [33]:
pd.value_counts(obj,sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [34]:
obj.isin(['b','c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [35]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [36]:
#how to apply to dataframe

In [37]:
data= DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [39]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Handling Missing Data

In [2]:
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
#to check null values
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
#the python built in None value is also treated as NA in object arrays:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# Filtering out missing data

In [10]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [13]:
string_data[string_data.notnull()]

1    artichoke
3      avocado
dtype: object

In [15]:
from numpy import nan as NA
data=DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned=data.dropna()#it filters out rows conatining NA values
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')#only drop rows containing all NA values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1,how='all')#dropping columns

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
#suppose we want to keep only rows containg a certain no of observations
df=DataFrame(np.random.randn(7,3))
df.ix[:4,1]=NA
df.ix[:2,2]=NA
df

          0         1         2
0  1.470296       NaN       NaN
1  0.685937       NaN       NaN
2  0.059461       NaN       NaN
3  0.253188       NaN -1.130176
4 -0.523573       NaN  0.077494
5  1.772892 -0.670342 -0.097233
6  0.531105  0.676958 -0.058707

In [22]:
df.dropna(thresh=3)

          0         1         2
5  1.772892 -0.670342 -0.097233
6  0.531105  0.676958 -0.058707

# Filling in missing Data

In [24]:
df.fillna(0)

          0         1         2
0  1.470296  0.000000  0.000000
1  0.685937  0.000000  0.000000
2  0.059461  0.000000  0.000000
3  0.253188  0.000000 -1.130176
4 -0.523573  0.000000  0.077494
5  1.772892 -0.670342 -0.097233
6  0.531105  0.676958 -0.058707

In [26]:
#using different values for each column
df.fillna({1:0.5,2:-1})

          0         1         2
0  1.470296  0.500000 -1.000000
1  0.685937  0.500000 -1.000000
2  0.059461  0.500000 -1.000000
3  0.253188  0.500000 -1.130176
4 -0.523573  0.500000  0.077494
5  1.772892 -0.670342 -0.097233
6  0.531105  0.676958 -0.058707

In [27]:
#fillna returns a new object,but you can modify the exisiting object

In [28]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0  1.470296  0.000000  0.000000
1  0.685937  0.000000  0.000000
2  0.059461  0.000000  0.000000
3  0.253188  0.000000 -1.130176
4 -0.523573  0.000000  0.077494
5  1.772892 -0.670342 -0.097233
6  0.531105  0.676958 -0.058707

In [29]:
df=DataFrame(np.random.randn(6,3))
df.ix[2:,1]=NA
df.ix[4:,2]=NA
df

          0         1         2
0  1.044907  0.567560  0.632409
1 -0.042748 -0.980834 -0.707240
2 -1.245413       NaN -0.461624
3  0.080266       NaN -0.370006
4 -0.891811       NaN       NaN
5 -0.973330       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  1.044907  0.567560  0.632409
1 -0.042748 -0.980834 -0.707240
2 -1.245413 -0.980834 -0.461624
3  0.080266 -0.980834 -0.370006
4 -0.891811 -0.980834 -0.370006
5 -0.973330 -0.980834 -0.370006

In [31]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.044907  0.567560  0.632409
1 -0.042748 -0.980834 -0.707240
2 -1.245413 -0.980834 -0.461624
3  0.080266 -0.980834 -0.370006
4 -0.891811       NaN -0.370006
5 -0.973330       NaN -0.370006

# Heirarichal indexing

In [32]:
#Heirarichal indexing is to have multiple index values on an axis.
data=Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data

a  1    1.566883
   2    1.067199
   3   -0.354780
b  1   -1.908781
   2    0.855437
   3    0.695766
c  1    0.042107
   2    0.426964
d  2    1.525730
   3   -0.207692
dtype: float64

In [33]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [34]:
#with a heirarichal indexing partial index is possible

In [35]:
data['b']

1   -1.908781
2    0.855437
3    0.695766
dtype: float64

In [36]:
data['b':'c']

b  1   -1.908781
   2    0.855437
   3    0.695766
c  1    0.042107
   2    0.426964
dtype: float64

In [37]:
data.ix[['b','d']]

b  1   -1.908781
   2    0.855437
   3    0.695766
d  2    1.525730
   3   -0.207692
dtype: float64

In [38]:
data[:,2]

a    1.067199
b    0.855437
c    0.426964
d    1.525730
dtype: float64

In [39]:
#to convert to dataframe
data.unstack()

          1         2         3
a  1.566883  1.067199 -0.354780
b -1.908781  0.855437  0.695766
c  0.042107  0.426964       NaN
d       NaN  1.525730 -0.207692

In [40]:
#to convert back to heirarichal indexing
data.unstack().stack()

a  1    1.566883
   2    1.067199
   3   -0.354780
b  1   -1.908781
   2    0.855437
   3    0.695766
c  1    0.042107
   2    0.426964
d  2    1.525730
   3   -0.207692
dtype: float64

In [42]:
#With a dataframe,either axis can have a heirarichal indexing:
frame=DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['ohio','ohio','colorado'],['green','red','green']])
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [43]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [45]:
frame['ohio']['green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: green, dtype: int32

# Reordering and Sorting Levels

In [49]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [47]:
#the swaplevel takes two level numbers or names and returns a new object with the levels interchanged
frame.swaplevel('key1','key2')

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [48]:
frame.swaplevel(0,1)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
frame.swaplevel(0,1).sortlevel(0)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [52]:
frame.sortlevel(1)

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

# Summary Statistics by level

In [54]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [53]:
frame.sum(level='key2')

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [55]:
frame.sum(level='key1')

state  ohio     colorado
color green red    green
key1
a         3   5        7
b        15  17       19

In [57]:
frame.sum(level='color',axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

# Using a DataFrames columns

In [58]:
frame=DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [61]:
#dataframes set_index function will create a new DataFrame using one or more of its columns as index
frame2=frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [62]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [63]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [1]:
list(range(15))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [2]:
['a','b']

['a', 'b']

In [4]:
list('B:E')

['B', ':', 'E']